app/views/chat_rooms/show.html.erb

<div id="messages", class=" messages", data-chat-room-id="<%= @chat_room.id %>">
<% if @chat_room.messages.any? %>
---
SELECT "messages".* FROM "messages" WHERE "messages"."chat_room_id" = 1