app/controllers/chat_rooms_controller.rb

SELECT "chat_rooms".* FROM "chat_rooms"
---
  def index
    @chat_rooms = ChatRoom.all

INSERT INTO "chat_rooms" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["user_id", 1], ["created_at", 2016-11-16 21:36:05 UTC], ["updated_at", 2016-11-16 21:36:05 UTC]]
---
  def create
    @chat_room = current_user.chat_rooms.build(chat_room_params)
    if @chat_room.save

SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."chat_room_id" = 1
---
  def show
    @chat_room = ChatRoom.includes(:public_messages).find_by(id: params[:id])